In [1]:
# import
import pandas as pd
import numpy as np
from sqlalchemy import create_engine, func
import psycopg2

In [2]:
#read into csv
kidney_state_donor = pd.read_csv('resources/kidney_state_donor.csv')
kidney_state_race_abo = pd.read_csv('resources/kidney_state_race_abo.csv')
transplant_state_heart = pd.read_csv('resources/transplant_state_heart.csv')
transplant_state_kidney = pd.read_csv('resources/transplant_state_kidney.csv')
transplant_state_liver = pd.read_csv('resources/transplant_state_liver.csv')
transplant_state_lung = pd.read_csv('resources/transplant_state_lung.csv')
waiting_time = pd.read_csv('resources/waiting_time.csv')
waitinglist_state = pd.read_csv('resources/waitinglist_state.csv')

In [3]:
kidney_state_donor.head(3)

,State,Deceased_Living,2020,2019,2018,2017,2016,2015,2014,2013,...,1997,1996,1995,1994,1993,1992,1991,1990,1989,1988
0,Alabama,Deceased,160,194,162,154,154,122,116,104,...,80,100,98,92,79,68,82,86,79,74
1,Alaska,Deceased,32,41,30,31,22,20,28,18,...,10,9,12,11,16,12,17,19,10,6
2,Arizona,Deceased,284,319,261,254,208,165,150,187,...,62,76,71,62,51,47,55,47,57,66

In [4]:
kidney_state_race_abo.head(3)

,Race,State,ABO,2020,2019,2018,2017,2016,2015,2014,...,1997,1996,1995,1994,1993,1992,1991,1990,1989,1988
0,White,Alabama,A,18,10,25,17,11,15,28,...,16,17,12,12,17,14,15,10,10,8
1,White,Alaska,A,1,3,3,1,0,4,4,...,3,1,3,2,1,3,4,2,1,4
2,White,Arizona,A,22,23,28,14,18,23,27,...,14,15,7,8,13,7,6,7,5,1

In [5]:
transplant_state_heart.head(3)

,Unnamed: 0,2020,2019,2018,2017,2016,2015,2014,2013,2012,...,1997,1996,1995,1994,1993,1992,1991,1990,1989,1988
0,All Center States,"3,378","3,552","3,408","3,244","3,191","2,804","2,655","2,531","2,378",...,"2,293","2,343","2,363","2,340","2,297","2,170","2,127","2,107","1,705","1,676"
1,Alabama,24,29,36,36,20,26,29,31,22,...,46,50,39,42,41,28,31,37,20,21
2,Arizona,74,63,77,77,81,65,40,29,45,...,33,30,33,41,37,31,34,43,40,38

In [6]:
#column names incomplete
transplant_state_heart.columns.values.tolist()

['Unnamed: 0',
 '2020',
 '2019',
 '2018',
 '2017',
 '2016',
 '2015',
 '2014',
 '2013',
 '2012',
 '2011',
 '2010',
 '2009',
 '2008',
 '2007',
 '2006',
 '2005',
 '2004',
 '2003',
 '2002',
 '2001',
 '2000',
 '1999',
 '1998',
 '1997',
 '1996',
 '1995',
 '1994',
 '1993',
 '1992',
 '1991',
 '1990',
 '1989',
 '1988']

In [7]:
#rename unnamed
transplant_state_heart = transplant_state_heart.rename(columns={"Unnamed: 0": "State"})
transplant_state_heart.head(3)

,State,2020,2019,2018,2017,2016,2015,2014,2013,2012,...,1997,1996,1995,1994,1993,1992,1991,1990,1989,1988
0,All Center States,"3,378","3,552","3,408","3,244","3,191","2,804","2,655","2,531","2,378",...,"2,293","2,343","2,363","2,340","2,297","2,170","2,127","2,107","1,705","1,676"
1,Alabama,24,29,36,36,20,26,29,31,22,...,46,50,39,42,41,28,31,37,20,21
2,Arizona,74,63,77,77,81,65,40,29,45,...,33,30,33,41,37,31,34,43,40,38

In [8]:
transplant_state_kidney.head(3)

,Unnamed: 0,2020,2019,2018,2017,2016,2015,2014,2013,2012,...,1997,1996,1995,1994,1993,1992,1991,1990,1989,1988
0,All Center States,"20,932","23,401","21,167","19,849","19,060","17,878","17,108","16,896","16,487",...,"11,710","11,411","11,084","10,646","10,360","9,738","9,678","9,416","8,656","8,878"
1,Alabama,317,296,275,307,216,221,234,242,206,...,279,281,300,267,313,239,251,263,238,210
2,Arizona,607,726,638,627,609,502,432,467,377,...,148,137,137,153,149,109,113,121,147,140

In [9]:
#rename unnamed
transplant_state_kidney = transplant_state_kidney.rename(columns={"Unnamed: 0": "State"})
transplant_state_kidney.head(3)

,State,2020,2019,2018,2017,2016,2015,2014,2013,2012,...,1997,1996,1995,1994,1993,1992,1991,1990,1989,1988
0,All Center States,"20,932","23,401","21,167","19,849","19,060","17,878","17,108","16,896","16,487",...,"11,710","11,411","11,084","10,646","10,360","9,738","9,678","9,416","8,656","8,878"
1,Alabama,317,296,275,307,216,221,234,242,206,...,279,281,300,267,313,239,251,263,238,210
2,Arizona,607,726,638,627,609,502,432,467,377,...,148,137,137,153,149,109,113,121,147,140

In [10]:
transplant_state_liver.head(3)

,Unnamed: 0,2020,2019,2018,2017,2016,2015,2014,2013,2012,...,1997,1996,1995,1994,1993,1992,1991,1990,1989,1988
0,All Center States,"8,193","8,896","8,250","8,082","7,841","7,127","6,730","6,455","6,256",...,"4,189","4,087","3,934","3,652","3,440","3,064","2,953","2,690","2,202","1,713"
1,Alabama,97,133,125,133,149,120,107,103,110,...,86,86,82,63,41,31,24,23,10,3
2,Arizona,284,332,289,248,236,142,135,152,133,...,21,29,22,26,32,8,13,12,9,8

In [11]:
#rename unnamed
transplant_state_liver = transplant_state_liver.rename(columns={"Unnamed: 0": "State"})
transplant_state_liver.head(3)

,State,2020,2019,2018,2017,2016,2015,2014,2013,2012,...,1997,1996,1995,1994,1993,1992,1991,1990,1989,1988
0,All Center States,"8,193","8,896","8,250","8,082","7,841","7,127","6,730","6,455","6,256",...,"4,189","4,087","3,934","3,652","3,440","3,064","2,953","2,690","2,202","1,713"
1,Alabama,97,133,125,133,149,120,107,103,110,...,86,86,82,63,41,31,24,23,10,3
2,Arizona,284,332,289,248,236,142,135,152,133,...,21,29,22,26,32,8,13,12,9,8

In [12]:
transplant_state_lung.head(3)

,Unnamed: 0,2020,2019,2018,2017,2016,2015,2014,2013,2012,...,1997,1996,1995,1994,1993,1992,1991,1990,1989,1988
0,All Center States,"2,362","2,714","2,530","2,449","2,327","2,057","1,925","1,923","1,754",...,932,815,872,724,667,535,405,203,93,33
1,Alabama,12,8,19,18,15,17,21,24,18,...,27,25,27,23,11,9,6,2,1,0
2,Arizona,124,150,145,117,128,101,73,71,58,...,7,6,7,6,5,4,4,4,0,0

In [13]:
#rename unnamed
transplant_state_lung = transplant_state_lung.rename(columns={"Unnamed: 0": "State"})
transplant_state_lung.head(3)

,State,2020,2019,2018,2017,2016,2015,2014,2013,2012,...,1997,1996,1995,1994,1993,1992,1991,1990,1989,1988
0,All Center States,"2,362","2,714","2,530","2,449","2,327","2,057","1,925","1,923","1,754",...,932,815,872,724,667,535,405,203,93,33
1,Alabama,12,8,19,18,15,17,21,24,18,...,27,25,27,23,11,9,6,2,1,0
2,Arizona,124,150,145,117,128,101,73,71,58,...,7,6,7,6,5,4,4,4,0,0

In [14]:
waiting_time.head(3)

,Unnamed: 0,All Organs,Kidney,Liver,Pancreas,Kidney / Pancreas,Heart,Lung,Heart / Lung,Intestine,Abdominal Wall,Head & Neck: Craniofacial,GU: Uterus,Upper Limb: Bilateral,Upper Limb: Unilateral,"Face, Scalp",Trachea
0,All Time,"108,269","91,578","11,979",885,"1,687","3,503",977,42,219,4,2,6,3,3,1,1
1,< 30 Days,"3,965","2,830",716,29,91,274,160,4,10,0,0,0,0,0,0,0
2,30 to < 90 Days,"7,513","5,687","1,215",68,183,407,175,6,17,0,0,0,0,0,0,0

In [15]:
waitinglist_state.head(3)

,Unnamed: 0,Kidney,Liver,Pancreas,Kidney / Pancreas,Heart,Lung,Heart / Lung,Intestine,Abdominal Wall,Head & Neck: Craniofacial,GU: Uterus,Upper Limb: Bilateral,Upper Limb: Unilateral,"Face, Scalp",Trachea
0,All Center States,"91,578","11,979",885,"1,687","3,503",977,42,219,4,2,6,3,3,1,1
1,Alabama,"1,094",103,5,8,23,11,0,0,0,0,0,0,0,0,0
2,Arizona,"1,422",197,4,20,26,9,0,0,0,0,0,0,0,0,0

In [16]:
#rename unnamed
waitinglist_state = waitinglist_state.rename(columns={"Unnamed: 0": "State"})
waitinglist_state.head(3)

,State,Kidney,Liver,Pancreas,Kidney / Pancreas,Heart,Lung,Heart / Lung,Intestine,Abdominal Wall,Head & Neck: Craniofacial,GU: Uterus,Upper Limb: Bilateral,Upper Limb: Unilateral,"Face, Scalp",Trachea
0,All Center States,"91,578","11,979",885,"1,687","3,503",977,42,219,4,2,6,3,3,1,1
1,Alabama,"1,094",103,5,8,23,11,0,0,0,0,0,0,0,0,0
2,Arizona,"1,422",197,4,20,26,9,0,0,0,0,0,0,0,0,0

In [17]:
kidney_state_donor.to_csv('resources/cleaned_csvs/kidney_state_donor_cleaned.csv',index = False)
kidney_state_race_abo.to_csv('resources/cleaned_csvs/kidney_state_race_abo_cleaned.csv',index = False)
transplant_state_heart.to_csv('resources/cleaned_csvs/transplant_state_heart_cleaned.csv',index = False)
transplant_state_kidney.to_csv('resources/cleaned_csvs/transplant_state_kidney_cleaned.csv',index = False)
transplant_state_liver.to_csv('resources/cleaned_csvs/transplant_state_liver_cleaned.csv',index = False)
transplant_state_lung.to_csv('resources/cleaned_csvs/transplant_state_lung_cleaned.csv',index = False)
waiting_time.to_csv('resources/cleaned_csvs/waiting_time_cleaned.csv',index = False)
waitinglist_state.to_csv('resources/cleaned_csvs/waiting_list_cleaned.csv',index = False)

In [18]:
# Create PostgreSQL RDS Database Connection
engine = create_engine("postgres+psycopg2://postgres:Group2Final@optn-analysis.cwcmoauclg7w.us-east-2.rds.amazonaws.com:5432/optn")

In [19]:
conn = engine.connect()

In [20]:
# Check table names
engine.table_names()

[]